Revit 2027 API
CurveArray Class
An array that can contain curves.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurveArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveArray : APIObject, IEnumerable
Public Class CurveArray
	Inherits APIObject
	Implements IEnumerable
public ref class CurveArray : public APIObject,
	IEnumerable
type CurveArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The CurveArray type exposes the following members.
Constructors
Name | Description
CurveArray | Initializes a new instance of the CurveArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Item | Gets or sets a curve at a specified index within the array.
Size | Returns the number of curves that are in the array.
Top
Methods
Name | Description
Append | Add the curve to the end of the array.
Clear | Removes every curve from the array, rendering it empty.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified curve into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace